% Расчёт В

disp ('Программа для расчёта NTC датчиков. Введите данные:');
T0 = input ('Введите опорную температуру: '); 
R0 = input ('Введите сопротивление датчика при этой температуре: ');
T2 = input ('Введите вторую температуру: '); 
R2 = input ('Введите сопротивление датчика при этой температуре: ');

T0 = T0+273;
T2 = T2+273;

if T2>T0
    B = (T2*T0/(T2-T0))*log(R0/R2);
else  
    B = (T0*T0/(T0-T0))*log(R2/R0);
end
disp(B);

T0 = T0-273;
T2 = T2-273;

% Расчёт таблички

Temp = str2num(input('Введите диапазон рабочей температуры (через точку с запятой) :','s'));
for k = 1:1:6
    Temp(k,2) = R0 * exp(B*(1/(Temp(k)+273)-1/(T0+273)));
    Temp(k,3) = (Temp(4,1)*(R0+Temp(6,1))-2*R0*Temp(6,1))/(R0+Temp(6,1)-2*Temp(4,1));
    Temp(k,4) = (Temp(k,2)*Temp(k,3))/(Temp(k,2)+Temp(k,3));
end

% Строим графики
x = Temp(:,1);
y1 = Temp(:,2);
y2 = Temp(:,4);

tiledlayout(2,1)
nexttile
plot(x,y1);
nexttile
plot(x,y2);
grid on;